Repository: Weskker/sudoku-solver
Catalog: po/*.po
Languages: fr

source: Memory allocation error (%s, %s, %i)
fr: Erreur d'allocation mémpire (%s, %s, %i)

source: %s: the values (%s) can only lie in %s.
fr: %s : les valeurs (%s) ne peuvent apparaitre que dans %s.

source: %s: the value (%s) can only lie in %s.
fr: %s : la valeur (%s) ne peut apparaitre que dans %s.

source: Value %i in each one of the %i rows [%s] lie only in one of the columns [%s]. -> Value %i in each one of the %i columns [%s] can only lie in the rows [%s].
fr: La valeur %i des %i lignes [%s] n'apparait que dans l'une des colonnes [%s]. -> La valeur %i des %i colonnes [%s] ne peut apparaitre que dans l'une des lignes [%s].

source: Value %i in row [%s] lies only in column [%s]. -> Value %i in column [%s] can only lie in the row [%s].
fr: La valeur %i de la ligne [%s] n'apparait que dans la colonne [%s]. -> La valeur %i de la colonne [%s] ne peut apparaitre que dans la ligne [%s].

source: Value %i in each one of the %i columns [%s] lie only in one of the rows [%s]. -> Value %i in each one of the %i rows [%s] can only lie in the columns [%s].
fr: La valeur %i des %i colonnes [%s] n'apparait que dans l'une des lignes [%s]. -> La valeur %i des %i lignes [%s] ne peut apparaitre que dans l'une des colonnes [%s].

source: Value %i in column [%s] lies only in row [%s]. -> Value %i in row [%s] can only lie in the column [%s].
fr: La valeur %i de la colonne [%s] n'apparait que dans la ligne [%s]. -> La valeur %i de la ligne [%s] ne peut apparaitre que dans la colonne [%s].

source: %s: each one of the %i cells [%s] can only accept one of the %i values (%s). -> %s: each one of the %i values (%s) can only lie in one of the %i cells [%s].
fr: %s : chacune des %i cases [%s] ne peut accepter que les %i valeurs (%s). -> %s : les %i valeurs (%s) ne peuvent apparaitre que les %i cases [%s].

source: %s: the cell [%s] can only accept the value (%s). -> %s: the value (%s) can only lie in the cell [%s].
fr: %s : la case [%s] ne peut accepter que dans la valeur (%s). -> %s : la valeur (%s) ne peut apparaitre que la case [%s].

source: %s: each one of the %i values (%s) can only lie in one of the %i cells [%s]. -> %s: each one of the %i cells [%s] can only accept one of the %i values (%s).
fr: %s : chacune des %i valeurs (%s) ne peut apparaitre que les %i cases [%s]. -> %s : les %i cases [%s] ne peuvent accepter que les %i valeurs (%s).

source: %s: the value (%s) can only lie in the cell [%s]. -> %s: the cell [%s] can only accept the value (%s).
fr: %s : la valeur (%s) ne peut apparaitre que dans la case [%s]. -> %s : la case [%s] ne peut accepter que la valeur (%s).

source: ### Cell %s must contain %c [%2i] ###
fr: ### La case %s ne peut contenir que la valeur %c [%2i] ###

source: Unexpected error (%s, %s, %i).
fr: Erreur inattendue (%s, %s, %i).

source: => Invalid grid.
fr: => Grille invalide.

source: ??? Hypothesis: cell %s = %c ? (out of %s) [%2i] ???
fr: ??? Devinette : case %s = %c ? (parmi %s choix possibles) [%2i] ???

source: %%%%%% Incorrect guess: cell %s = %c [%2i] (after %i steps). %%%%%%
fr: %%%%%% Supposition incorrecte: case %s = %c [%2i] (après %i étapes). %%%%%%

source: Solved using elimination method (solution #%i).
fr: Résolu par déductions (solution #%i).

source: Solved using backtracking method (solution #%i, %i tries).
fr: Résolu par la force brute (solution #%i, %i essais).

source: Row %c
fr: Ligne %c

source: Column %c
fr: Colonne %c

source: Square %c%c-%c%c
fr: Carré %c%c-%c%c

source: Segment %c%c-%c%c
fr: Zone %c%c-%c%c

source: Grid is not valid.
fr: La grille n'est pas valide.

source: %i solution found.
fr: %i solution a été trouvée.

source: Solved with %i rules and %i hypothesis.
fr: Résolu par %i règles et %i devinettes.

source: Cell Exclusion:
fr: Cases exclues :

source: Depth %i: %i
fr: Profondeur %i: %i

source: Candidate Exclusion:
fr: Candidats exclus :

source: Value Exclusion:
fr: Valeurs exclues :

source: Regions Exclusion:
fr: Régions exclues :

source: Backtracking:
fr: Force brute :

source: Depth: %i
fr: Profondeur : %i

source: Steps: %i
fr: Etape : %i

source: Hypothesis: %i
fr: Devinette : %i

source: Solved using exact cover search method.
fr: Résolu par la méthode de recherche de couverture exact.
